Docmentation updated.
